<?php
/**
 * Created by PhpStorm.
 * Date: 16/10/31
 * Time: 上午10:41
 */







/*
 * 打开小程序对应的场景值
 * */
function get_scene_value() {

    $scene_value = array(
        "1001" => "发现栏小程序主入口，“最近使用”列表",
        "1005" => "顶部搜索框的搜索结果页",
        "1006" => "发现栏小程序主入口搜索框的搜索结果页",
        "1007" => "单人聊天会话中的小程序消息卡片",
        "1008" => "群聊会话中的小程序消息卡片",
        "1011" => "扫描二维码",
        "1012" => "长按图片识别二维码",
        "1013" => "手机相册选取二维码",
        "1014" => "小程序模版消息",
        "1017" => "前往体验版的入口页",
        "1019" => "微信钱包",
        "1020" => "公众号 profile 页相关小程序列表",
        "1022" => "聊天顶部置顶小程序入口",
        "1023" => "安卓系统桌面图标",
        "1024" => "小程序 profile 页",
        "1025" => "扫描一维码",
        "1026" => "附近小程序列表",
        "1027" => "顶部搜索框搜索结果页“使用过的小程序”列表",
        "1028" => "我的卡包",
        "1029" => "卡券详情页",
        "1030" => "自动化测试下打开小程序",
        "1031" => "长按图片识别一维码",
        "1032" => "手机相册选取一维码",
        "1034" => "微信支付完成页",
        "1035" => "公众号自定义菜单",
        "1036" => "App 分享消息卡片",
        "1037" => "小程序打开小程序",
        "1038" => "从另一个小程序返回",
        "1039" => "摇电视",
        "1042" => "添加好友搜索框的搜索结果页",
        "1043" => "公众号模板消息",
        "1044" => "带 shareTicket 的小程序消息卡片",
        "1045" => "朋友圈广告",
        "1046" => "朋友圈广告详情页",
        "1047" => "扫描小程序码",
        "1048" => "长按图片识别小程序码",
        "1049" => "手机相册选取小程序码",
        "1052" => "卡券的适用门店列表",
        "1053" => "搜一搜的结果页",
        "1054" => "顶部搜索框小程序快捷入口",
        "1055" => "音乐播放器菜单",
        "1056" => "钱包中的银行卡详情页",
        "1057" => "公众号文章",
        "1058" => "体验版小程序绑定邀请页",
        "1059" => "微信连Wi-Fi状态栏",
        "1064" => "公众号文章广告",
        "1067" => "附近小程序列表广告",
        "1068" => "移动应用",
        "1069" => "钱包中的银行卡列表页",
        "1071" => "二维码收款页面",
        "1072" => "客服消息列表下发的小程序消息卡片",
        "1073" => "公众号会话下发的小程序消息卡片",
        "1074" => "摇周边",
        "1077" => "连Wi-Fi成功页",
        "1078" => "微信游戏中心",
        "1081" => "客服消息下发的文字链",
        "1082" => "公众号会话下发的文字链",
        "1084" => "朋友圈广告原生页",
        "1089" => "微信聊天主界面下拉，“最近使用”栏",
        "1090" => "长按小程序右上角菜单唤出最近使用历史",
        "1091" => "公众号文章商品卡片",
        "1092" => "城市服务入口",
        "1095" => "小程序广告组件",
        "1096" => "聊天记录",
        "1097" => "微信支付签约页",
        "1099" => "页面内嵌插件",
        "1102" => "公众号 profile 页服务预览",
        "1103" => "发现栏小程序主入口，“我的小程序”列表",
        "1104" => "微信聊天主界面下拉，“我的小程序”栏",
    );

    return $scene_value;

}


/*
 *  判断数组是否一致
 *  返回1 为包含 返回0为不包含
 *  $array1 验证是否包含的数组  $array2  验证的数组
 *  return  array   $array
 * */
function judge_array($array1,$array2)
{
    if(!is_array($array1)) {
        $array1 = explode(",",$array1);
    }
    if(!is_array($array2)) {
        $array2 = explode(",",$array2);
    }
    //判断项目的属性是否包含在小程序账号的属性里
    if ($array2 == array_intersect($array2, $array1)) {
        $flag = 1;
    }else {
        $flag = 0;
    }

    return $flag;
}

/**
 *比较两个数组  返回$arr2 在 $arr1 中 增加和减少的数据
 * @param $arr1 array
 * @param $arr2 array
 * Author: zhangxin11@leju.com
 */
function array_increase_or_decrease ($arr1,$arr2) {
    $array = array();
    foreach($arr2 as $k=>$v) {
        //如果
        if(!in_array($v,$arr1)) {
            $array['increase'][] = $v;
        }else {
            $array['decrease'][] = $v;
        }
    }
    $array['decrease'] = array_diff($arr1,$arr2);
    return $array;

}


